<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/agregacao_operacao.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Imports

In [1]:
import pandas as pd
import numpy as np

# Funcionamento do GroupBy

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'], 'key':['one','two','one','two','one'], 'data1': np.random.randn(5), 'data2': np.random.randn(5)})
df

  key1  key     data1     data2
0    a  one -0.950897 -0.694694
1    a  two  0.596709  0.178958
2    b  one  0.094659  1.470432
3    b  two -0.173237  0.739496
4    a  one -1.079050  0.226275

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.477746
b   -0.039289
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key']]).mean()
means

key1  key
a     one   -1.014973
      two    0.596709
b     one    0.094659
      two   -0.173237
Name: data1, dtype: float64

In [6]:
means.unstack()

key        one       two
key1
a    -1.014973  0.596709
b     0.094659 -0.173237

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.596709
            2006    0.094659
Ohio        2005   -0.562067
            2006   -1.079050
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.477746 -0.096487
b    -0.039289  1.104964

In [9]:
df.groupby(['key1', 'key']).mean()

             data1     data2
key1 key
a    one -1.014973 -0.234210
     two  0.596709  0.178958
b    one  0.094659  1.470432
     two -0.173237  0.739496

In [10]:
df.groupby(['key1', 'key']).size()

key1  key
a     one    2
      two    1
b     one    1
      two    1
dtype: int64

**Iterando por grupos**

In [11]:
for nome, grupo in df.groupby('key1'):
  print(nome)
  print(grupo)

a
  key1  key     data1     data2
0    a  one -0.950897 -0.694694
1    a  two  0.596709  0.178958
4    a  one -1.079050  0.226275
b
  key1  key     data1     data2
2    b  one  0.094659  1.470432
3    b  two -0.173237  0.739496

In [12]:
for (k1,k2), grupo in df.groupby(['key1','key']):
  print((k1,k2))
  print(grupo)

('a', 'one')
  key1  key     data1     data2
0    a  one -0.950897 -0.694694
4    a  one -1.079050  0.226275
('a', 'two')
  key1  key     data1     data2
1    a  two  0.596709  0.178958
('b', 'one')
  key1  key     data1     data2
2    b  one  0.094659  1.470432
('b', 'two')
  key1  key     data1     data2
3    b  two -0.173237  0.739496

In [13]:
#gerando dicionario com uma parte dos dados

parte = dict(list(df.groupby('key1')))
parte['b']

  key1  key     data1     data2
2    b  one  0.094659  1.470432
3    b  two -0.173237  0.739496

In [14]:
df.dtypes

key1      object
key       object
data1    float64
data2    float64
dtype: object

In [15]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype, grupo in grouped:
  print(dtype)
  print(grupo)

float64
      data1     data2
0 -0.950897 -0.694694
1  0.596709  0.178958
2  0.094659  1.470432
3 -0.173237  0.739496
4 -1.079050  0.226275
object
  key1  key
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

**Selecionando uma coluna ou um subconjunto de colunas**

In [16]:
df.groupby(['key1', 'key'])[['data2']].mean()

             data2
key1 key
a    one -0.234210
     two  0.178958
b    one  1.470432
     two  0.739496

In [17]:
s_grouped = df.groupby(['key1', 'key'])['data2']
s_grouped

In [18]:
s_grouped.mean()

key1  key
a     one   -0.234210
      two    0.178958
b     one    1.470432
      two    0.739496
Name: data2, dtype: float64

**Agrupando com dicionário e séries**

In [19]:
people = pd.DataFrame(np.random.randn(5,5), columns=['a','b','c','d','e'], index=['Joe', 'Steve','Wes','Jim','Travis'])

In [20]:
people.iloc[2:3, [1,2]] = np.nan
people

               a         b         c         d         e
Joe     0.474035 -1.204396  0.774253 -1.811567 -0.430256
Steve   0.069272  0.574580  0.078497 -0.438589 -0.282080
Wes     1.726387       NaN       NaN  1.761227 -0.721167
Jim    -0.758931  0.959213  0.250459 -0.937261 -0.888321
Travis -0.676906 -1.551953  0.141208  1.481632 -0.180313

In [21]:
#somar as colunas por grupo
mapping = {'a': 'red', 'b':'red', 'c':'blue', 'd':'blue','e':'red','f':'orange'}

In [22]:
by_columns = people.groupby(mapping, axis=1)
by_columns.sum()

            blue       red
Joe    -1.037315 -1.160617
Steve  -0.360091  0.361772
Wes     1.761227  1.005220
Jim    -0.686802 -0.688039
Travis  1.622839 -2.409172

In [23]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [24]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

**Agrupando com funções**

In [25]:
#agrupando por tamanho de string (contando string do índice)
people.groupby(len).sum()

          a         b         c         d         e
3  1.441492 -0.245184  1.024712 -0.987602 -2.039744
5  0.069272  0.574580  0.078497 -0.438589 -0.282080
6 -0.676906 -1.551953  0.141208  1.481632 -0.180313

In [26]:
key_list = ['one', 'one', 'one','two','two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.474035 -1.204396  0.774253 -1.811567 -0.721167
  two -0.758931  0.959213  0.250459 -0.937261 -0.888321
5 one  0.069272  0.574580  0.078497 -0.438589 -0.282080
6 two -0.676906 -1.551953  0.141208  1.481632 -0.180313

**Agrupando por níveis de índice**

In [27]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'], [1,3,5,1,3]], names=['cty','tenor'])
hier_df = pd.DataFrame(np.random.randn(4,5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.489621 -1.143690 -1.236613  0.037915 -0.082239
1     -0.461293  0.091006 -1.085946  0.566457 -0.550667
2      0.597845 -0.936193  0.174283  0.430452 -1.624372
3     -0.851736 -1.083951 -0.961886 -0.066014  0.800763

In [28]:
hier_df.groupby(level = 'cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

# Agregação de dados

In [31]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.287188
b    0.067869
Name: data1, dtype: float64

In [34]:
#Para usar uma função própria, utilize agg e passe a função entre parenteses
def peak_to_peak(arr):
  return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.675759  0.920968
b     0.267895  0.730936

In [35]:
grouped.describe()

     data1                      ...     data2
     count      mean       std  ...       50%       75%       max
key1                            ...
a      3.0 -0.477746  0.932709  ...  0.178958  0.202616  0.226275
b      2.0 -0.039289  0.189431  ...  1.104964  1.287698  1.470432

[2 rows x 16 columns]

**Aplicação de função nas colunas e aplicação de várias funções**

In [36]:
tips = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/tips.csv')

In [37]:
#Acrescenta a porcentagem de gorjeta sobre o total da conta
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [42]:
grouped = tips.groupby(['day','smoker'])
grouped_pct = grouped['tip_pct']
#É possivel passar uma função descritiva como string
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [43]:
grouped_pct.agg(['mean','std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [44]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [45]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [48]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [49]:
#personalizar o nome das colunas
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [50]:
grouped.agg({'tip': np.max, 'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [51]:
grouped.agg({'tip_pct':['min','max','mean','std'], 'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

**Devolvendo dados agregados sem índice de linha**

In [52]:
tips.groupby(['day','smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

# Método apply: separar-aplicar-combinar genérico